cf/Catalogs/алкЛицензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>алкЛицензии</Name>
			<Comment>Лицензии организаций и контрагентов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.нсиКонтрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Comment>Серия лицензии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Comment>Номер лицензии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер лицензии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Comment>Дата выдачи лицензии</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСрокаДействия</Name>
					<Comment>Дата начала срока действия лицензии</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСрокаДействия</Name>
					<Comment>Дата окончания срока действия лицензии</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганВыдачи</Name>
					<Comment>Орган выдачи лицензии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.алкТипыЛицензий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСрокаДействияДО</Name>
					<Comment>Дата окончания срока действия лицензии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/алкЛицензии/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	ИзменитьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	ИзменитьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерПриИзменении(Элемент)
	ИзменитьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаСрокаДействияПриИзменении(Элемент)
	ИзменитьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияСрокаДействияПриИзменении(Элемент)
	ИзменитьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаименование()

	Объект.Наименование = СформироватьНаименование();

КонецПроцедуры

Функция СформироватьНаименование() Экспорт

	СтрокаНаименования = "";
	
	Если ЗначениеЗаполнено(Объект.Серия) Тогда
		СтрокаНаименования = СтрокаНаименования + ?(СокрЛП(СтрокаНаименования)="","",", ")
			+ СокрЛП(Объект.Серия);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Номер) Тогда
		СтрокаНаименования = СтрокаНаименования + ?(СокрЛП(СтрокаНаименования)="",""," ")
			+ СокрЛП(Объект.Номер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда
		СтрокаНаименования = СтрокаНаименования + ?(СокрЛП(СтрокаНаименования)="",""," ")
			+ "рег.№ "+СокрЛП(Объект.РегистрационныйНомер);
	КонецЕсли;
	
	СтрокаНаименования = СтрокаНаименования + ?(СокрЛП(СтрокаНаименования)="",""," ")
		+ "("+Формат(Объект.ДатаНачалаСрокаДействия, "ДФ=dd.MM.yy")+"-"+Формат(Объект.ДатаОкончанияСрокаДействия, "ДФ=dd.MM.yy")+")";
	
	Возврат СтрокаНаименования;

КонецФункции // СформироватьНаименование()

&НаКлиенте
Процедура ДатаОкончанияСрокаДействияДОПриИзменении(Элемент)
	
	Если Объект[Элемент.Имя] Тогда
		Элемент.Заголовок = "до";
		Элемент.Подсказка = "до даты не включая";
	Иначе
		Элемент.Заголовок = "по";
		Элемент.Подсказка = "по дату включительно";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ДатаОкончанияСрокаДействияДО Тогда
		Элементы.ДатаОкончанияСрокаДействияДО.Заголовок = "до";
		Элементы.ДатаОкончанияСрокаДействияДО.Подсказка = "до даты не включая";
	Иначе
		Элементы.ДатаОкончанияСрокаДействияДО.Заголовок = "по";
		Элементы.ДатаОкончанияСрокаДействияДО.Подсказка = "по дату включительно";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоВладельцу(ПунктыРазгрузки);
	
	// КутьяАА ITRR <<
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПолнаяСинхронизацияMDM = Истина;
	КонецЕсли; 
	GUID_MDM = Объект.Ссылка.УникальныйИдентификатор();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВладельцу(Список)

	//Если Список.Отбор.Элементы.Количество() Тогда
	//	Отбор = Список.Отбор.Элементы[0];
	//Иначе
	//	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	Отбор.ЛевоеЗначение = Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Владелец").Поле;
	//КонецЕсли; 
	//Отбор.ПравоеЗначение = Объект.Владелец;

	Если Список.Отбор.Элементы.Количество() Тогда
		Отбор = Список.Отбор.Элементы[0];
	Иначе
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("алкОсновнаяЛицензия").Поле;
	КонецЕсли; 
	Отбор.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры // 	УстановитьОтборПоВладельцу()


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//КутьяАА ITRR <<
	УстановитьОтборПоВладельцу(ПунктыРазгрузки);
	
	УИ = Объект.Ссылка.УникальныйИдентификатор();
	Если НЕ GUID_MDM = УИ Тогда
		GUID_MDM = УИ;
	КонецЕсли; 
	//>>
КонецПроцедуры
